# 다음 퀴즈를 수행하시오.

### Q1. pandas 모듈을 pd로, numpy 모듈을 np로 불러오시오.

In [1]:
import pandas as pd
import numpy as np

### Q2. "class_scores.csv"를 pandas 모듈을 활용하여 불러오고 객체 종류를 확인하시오
(단, df 객체에 저장하시오)

In [2]:
df = pd.read_csv("class_scores.csv")
type(df)

pandas.core.frame.DataFrame

### Q3. df의 첫 3개 row를 출력하시오

In [3]:
df.head(3)

   Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
0   10101      1     A      M    55       84       50         40       59
1   10102      1     A      M    29       94       41         87       57
2   10103      1     A      F    28       80       68         41      100

### Q4. df의 마지막 2개 row를 출력하시오

In [4]:
df.tail(2)

     Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
598   30539      3     E      M    51       67       39         91       55
599   30540      3     E      M    76       29       80         91       66

### Q5. df의 차원을 확인하시오

In [5]:
df.ndim

2

### Q6. df의 row 개수를 확인하시오

In [6]:
df.shape[0]

600

### Q7. df의 column 개수를 확인하시오

In [7]:
df.shape[1]

9

### Q8. df의 column 이름을 확인하시오

In [8]:
df.columns

Index(['Stu_ID', 'grade', 'class', 'gender', 'Math', 'English', 'Science',
       'Marketing', 'Writing'],
      dtype='object')

### Q9. 2학년의 학번, 학년, 성적 전체를 추출하여 df_sub 객체에 저장하시오.

In [9]:
df_sub = df.loc[df['grade'] == 2, :]
df_sub

     Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
200   20101      2     A      M    57       68       98         88       40
201   20102      2     A      F    94       33       32         44       90
202   20103      2     A      M    75       73       34         37       85
203   20104      2     A      M    73       85       35         39       65
204   20105      2     A      F    64       26       86         64       72
..      ...    ...   ...    ...   ...      ...      ...        ...      ...
395   20536      2     E      F    29       33       95         40       51
396   20537      2     E      M    95      100       96         95       60
397   20538      2     E      M    79       55       32         78       31
398   20539      2     E      M    74       60       99         68       80
399   20540      2     E      F    58       88       35         92       41

[200 rows x 9 columns]

### Q10. df_sub를 기준으로 학생 개개인의 성적 평균을 계산하고 학번과 같이 "score_avg.csv"로 저장하시오.

In [10]:
df_mean = df_sub.loc[:,df_sub.columns[4:]].mean(axis=1).to_frame().rename(columns={0: "score_avg"})
df_new = pd.concat([df_sub, df_mean], axis=1)
df_new.to_csv("score_avg.csv")
df_new

,Stu_ID,grade,class,gender,Math,English,Science,Marketing,Writing,score_avg
200,20101,2,A,M,57,68,98,88,40,70.2
201,20102,2,A,F,94,33,32,44,90,58.6
202,20103,2,A,M,75,73,34,37,85,60.8
203,20104,2,A,M,73,85,35,39,65,59.4
204,20105,2,A,F,64,26,86,64,72,62.4
...,...,...,...,...,...,...,...,...,...,...
395,20536,2,E,F,29,33,95,40,51,49.6
396,20537,2,E,M,95,100,96,95,60,89.2
397,20538,2,E,M,79,55,32,78,31,55.0
398,20539,2,E,M,74,60,99,68,80,76.2
399,20540,2,E,F,58,88,35,92,41,62.8

### Q11. df_sub를 기준으로 과목별 성적 최고점, 최저점, 표준편차를 계산하고 과목명과 함께 score_stat에 저장하시오.

In [11]:
df_subject = df_sub.loc[:,df_sub.columns[4:]]
df_subject_mean = df_subject.mean().to_frame(name="mean_score")
df_subject_max = df_subject.max().to_frame(name="max_score")
df_subject_min = df_subject.min().to_frame(name="min_score")
df_subject_std = df_subject.std().to_frame(name="std")
# score_stat  = pd.DataFrame({"subject": df_subject.columns, "max_score": df_subject_max, "min_score": df_subject_min, "std": df_subject_std})
score_stat = pd.concat([df_subject_max, df_subject_min, df_subject_std], axis=1)
score_stat

           max_score  min_score        std
Math             100         25  21.966154
English          100         25  20.638307
Science          100         25  23.344244
Marketing        100         25  22.021939
Writing          100         25  21.772637

### Q12. score_stat의 index를 0 ~ 4로 만드시오.

In [12]:
score_stat = score_stat.reset_index(drop=True)
score_stat

   max_score  min_score        std
0        100         25  21.966154
1        100         25  20.638307
2        100         25  23.344244
3        100         25  22.021939
4        100         25  21.772637

### Q13. score_stat 객체를 "score_stat.csv"로 저장하시오.

In [13]:
score_stat.to_csv("score_stat.csv", index = False)